//
//  WeiMiMyCollectionListRequest.h
//  weiMi
//
//  Created by 梁宪松 on 2016/10/20.
//  Copyright © 2016年 madaoCN. All rights reserved.
//

#import "WeiMiBaseRequest.h"



@interface WeiMiMyCollectionListRequest : WeiMiBaseRequest
-(id)initWithMemberId:(NSString *)memberId isAble:(NSString *)isAble
            pageIndex:(NSInteger)pageIndex pageSize:(NSInteger)pageSize;


@end


//
//{
//    "result": [
//               {
//                   "infoId": 12,
//                   "infoTitle": "测试标题",
//                   "description": "简介内容",
//                   "imgPath": "HeadPortrait/e76d91c1ea0e4dff92f393241e2608c3.jpg",
//                   "content": "测试内容的",
//                   "createTime": "2016-10-20 10:23:56",
//                   "type": 1,
//                   "isAble": 2,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 7,
//                   "infoTitle": "随随便便",
//                   "content": "<p style=\"text-indent:2em;font-family:Arial, Verdana, 宋体;background-color:#FFFFFF;\">\r\n\t<strong>京东价</strong>：京东价为商品的销售价，是您最终决定是否购买商品的依据。\r\n</p>\r\n<p style=\"text-indent:2em;font-family:Arial, Verdana, 宋体;background-color:#FFFFFF;\">\r\n\t<strong>划线价</strong>：商品展示的划横线价格为参考价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或该商品在京东平台上曾经展示过的销售价；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。\r\n</p>\r\n<p style=\"text-indent:2em;font-family:Arial, Verdana, 宋体;background-color:#FFFFFF;\">\r\n\t<strong>折扣</strong>：如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。\r\n</p>\r\n<p style=\"text-indent:2em;font-family:Arial, Verdana, 宋体;background-color:#FFFFFF;\">\r\n\t<strong>异常问题</strong>：商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。\r\n</p>",
//                   "createTime": "2016-07-29 01:06:18",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 1,
//                   "infoTitle": "a维护",
//                   "content": "阿斯顿发沙发套",
//                   "createTime": "2016-07-29 01:05:55",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 5,
//                   "infoTitle": "阿萨德法师打发",
//                   "content": "<p>\r\n\t1231231\r\n</p>\r\n<p>\r\n\t撒大声地\r\n</p>",
//                   "createTime": "2016-07-29 01:03:39",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 9,
//                   "infoTitle": "不正当行为规则",
//                   "content": "用户通过京东账户操作的各种行为应符合法律法规规定、平台规则规定及注册协议约定，当出现（包含但不限于）以下行为时，视为用户自愿同意接受京东或商家进行权益降级，扣除京豆，冻结或关闭京东账户，取消订单，不再提供服务等操作，且同意京东或商家不进行任何赔偿或补偿。如给京东或相关方造成损失，用户愿意承担相应责任：\r\n（1） 注册资料内容含虚假信息；\r\n（2） 虚假交易、虚假好评,发布无根据的恶意评价；\r\n（3） 购买正品商品，退货时退回非京东平台对应订单中销售的商品、以次充好、以假乱真等行为；\r\n（4） 无故、无正常理由拒收签收订单货物的行为；\r\n（5） 符合非正常订单中的行为；（非正常订单处理规则）",
//                   "createTime": "2016-07-28 23:46:07",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 2,
//                   "infoTitle": "收到的商品少了/发错货了",
//                   "content": "商品少件情况：\r\n\r\n同个订单购买多个商品可能会分为一个以上包裹发出，可能不会同时送达，建议您耐心等待1-2天，如未收到，京东自营商品可直接联系京东在线客服，第三方商家商品请联系商家在线客服。\r\n\r\n发错货情况：\r\n\r\n京东自营商品：若您确认收到的商品不是您订单中订购的商品，可直接点击“客户服务”下的返修/退换货或商品右侧的申请返修/退换货，出现返修及退换货首页，点击“申请”即可操作换货，提交成功后请耐心等待，由专业的售后工作人员受理您的申请。\r\n\r\n\r\n第三方商家商品：请直接联系商家的在线客服帮助您退/换货。",
//                   "createTime": "2016-07-28 23:44:49",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 4,
//                   "infoTitle": "这不是鸵鸟蛋，是蘑菇",
//                   "content": "马勃菌目 （学名：Lycoperdales），腹隔担子菌纲的一目，为真菌类生物，学名叫马勃，成熟的马勃一般比成人的拳头略小。因形状、颜色酷似马粪而俗称为“马粪包”。",
//                   "createTime": "2016-07-28 23:43:44",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 6,
//                   "infoTitle": "印度最“低贱”的人",
//                   "content": "种姓制度（印地语：हिन्दू वर्ण व्यवस्था，英语：Caste system in India，或作印度卡斯特体系）是曾在印度与南亚其他地区[1]  普遍存在的一种社会体系。\r\n种姓制度以婆罗门为中心，划分出许多以职业为基础的内婚制群体，即种姓。各种姓依所居地区不同而划分成许多次种姓，这些次种姓内部再依所居聚落不同分成许多聚落种姓，\r\n这些聚落种姓最后再分成行不同行外婚制的氏族，如此层层相扣，整合成一套散布于整个印度次大陆的社会体系。因此，种姓制度涵盖印度社会绝大多数的群体，并与印度的社会体系、宇宙观、宗教与人际关系息息相关，可说是传统印度最重要的社会制度与规范。\r\n一般认为，种姓制度是公元前600年左右，随雅利安人入侵印度而创立的社会制度。原本的种姓制度并非要划分阶级及人的高低贵贱，而是要确保本身雅利安人的执政权和保持各种工作都有一定的人数。\r\n然而随着马木留克、蒙兀尔等外来伊斯兰教征服者统治印度，种姓制度为了政权需要经历过许多调整，并且在英属印度时期为符合殖民者需要，被固定、僵化，成为阶级森严的阶序体系。由于该体系中的不平等与近代西方兴起的民主制度与人权思想大相径庭，因此常被批评为反现代化的落后制度，甚至被视为妨碍印度社会进步的毒瘤。\r\n1947年印度脱离殖民体系独立后，种姓制度的法律地位正式被废除，各种种姓分类与歧视被视为非法，然而在实际社会运作与生活上，其仍扮演相当重要的角色。",
//                   "createTime": "2016-07-28 23:43:23",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 8,
//                   "infoTitle": "烧帝王砖的传承人",
//                   "content": "京砖是浙江省嘉善县的汉族传统工艺品。制作需要经过取土、制坯、烧制、出窑、打磨和浸泡等几道工序。几道工序，听上去似乎也并不特别复杂，但其实每一道大的工序下面，还包含了好多道小工序，这些大大小小的工序加在一起，使得京砖的制作变成一件奢侈的事情。",
//                   "createTime": "2016-07-28 23:42:48",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 10,
//                   "infoTitle": "热辣的比基尼70岁了",
//                   "content": "（Bikini，香港称为“比坚尼”）一般指女性游泳时穿着的泳衣，即比基尼泳衣，也称“三点式游泳衣”。泳装可以说是服装史上最具有视觉冲击力的服装，背后系带的胸衣和三角裤的装束不亚于原子弹爆炸。直到20 世纪5 0 年代，这种能体现人体雕塑感的服装款式才被接受。今天，它已是柔美而自然的身体曲线的代名词。",
//                   "createTime": "2016-07-28 23:42:08",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 11,
//                   "infoTitle": "不爽猫举行粉丝见面会",
//                   "content": "不爽猫(Grumpy Cat)又名暴躁猫，是2012人气最高的喵星人，2012年走红的的喵星人，它原名叫塔妲·索斯（Tardar Sauce），是猫咪网络推手、好莱坞经纪人拉希什(BenLashes)的明星客户。天生臭脸引人追捧，它的主人通过图书出版、饮料推销等方式，获得多达约640万英镑的收益，甚至配有专属经理人为它安排“档期”。不爽猫出生时即患有侏儒症和反颌症，以至于其总是一副很不爽的表情。",
//                   "createTime": "2016-07-28 23:41:38",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               },
//               {
//                   "infoId": 3,
//                   "infoTitle": "40年前的那场地动山摇",
//                   "content": "1976年7月28日3时42分53.8秒，中国河北省唐山、丰南一带（东经118.2°，北纬39.6°）发生了强度里氏7.8级（矩震级7.5级）地震，震中烈度11度，震源深度12千米，地震持续约12秒。地震造成242769人死亡，16.4万人重伤，名列20世纪世界地震史死亡人数第二，仅次于海原地震。",
//                   "createTime": "2016-07-28 23:40:55",
//                   "type": 1,
//                   "isAble": 1,
//                   "memberId": "13051736787",
//                   "ringId": 1,
//                   "dianzan": 0,
//                   "pinglun": 0,
//                   "memberName": "该死的温柔"
//               }
//               ]
//}
